# # Вариант 2
#
# # 1 Задание
#
# import math
# def at(a):
#     s = (math.sqrt(3) * a**2) / 4
#     return s
# def ah(a):
#     ta = at(a)
#     ha = ta * 6
#     return ha
# sl = float(input("Введите длину стороны шестиугольника: "))
# ha = ah(sl)
# print("площадь правильного шестиугольника:", ha)

# # 2 Задание
# def ca(l, w):
#     return l * w
# def m():
#     a1 = float(input("Введите длину первой стороны прямоугольника: "))
#     b1 = float(input("Введите длину второй стороны прямоугольника: "))
#     a2 = float(input("Введите длину первой стороны второго прямоугольника: "))
#     b2 = float(input("Введите длину второй стороны второго прямоугольника: "))
#     a3 = float(input("Введите длину первой стороны третьего прямоугольника: "))
#     b3 = float(input("Введите длину второй стороны третьего прямоугольника: "))
#     s1 = ca(a1, b1)
#     s2 = ca(a2, b2)
#     s3 = ca(a3, b3)
#     print("Площадь первого прямоугольника:", s1)
#     print("Площадь второго прямоугольника:", s2)
#     print("Площадь третьего прямоугольника:", s3)
# m()