# задание с 3 ПР

# a = int(input('Введите число: '))
# b = int(input('Введите число: '))
# c = int(input('Введите число: '))
# if 1 <= a <= 3:
#     print("Число", a ,"принадлежит интервалу")
# if 1 <= b <= 3:
#     print("Число", b ,"принадлежит интервалу")
# if 1 <= c <= 3:
#     print("Число", c ,"принадлежит интервалу")

# задание 6 с СР

# a = int(input('Введите число: '))
# if a % 7 == 0:
#     print('Это число кратно 7')
# else: print('Это число не кратно 7')

# задание 13 с СР

# a = int(input('Введите желаемый год: '))
# if (a % 4 == 0) and (a % 100 != 0) or (a % 400 == 0):
#     print('Год является високосным,', 'дней в феврале: 29')
# else: print('Год не является високосным,', 'дней в феврале: 28')